.svn/pristine/f5/f5ad9345cb9cf7df517e99e55f76ef1997444bca.svn-base

<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope" xmlns:sym="http://syminterface.insurance.symbiosys.c2lbiz.com" xmlns:xsd="http://io.syminterface.insurance.symbiosys.c2lbiz.com/xsd" xmlns:xsd1="http://transferobjects.syminterface.insurance.symbiosys.c2lbiz.com/xsd" xmlns:xsd2="http://security.transferobjects.syminterface.insurance.symbiosys.c2lbiz.com/xsd">
    <soap:Header />
    <soap:Body>
        <sym:saveProposal>
            <!--Optional:-->
            <sym:wsGeneratePolicyNumIO>
                <!--Zero or more repetitions:-->
                <xsd:errorList>
                    <!--Optional:-->
                    <xsd1:errActualMessage></xsd1:errActualMessage>
                    <!--Optional:-->
                    <xsd1:errDescription></xsd1:errDescription>
                    <!--Optional:-->
                    <xsd1:errField></xsd1:errField>
                    <!--Optional:-->
                    <xsd1:errProcessStatusCd></xsd1:errProcessStatusCd>
                    <!--Optional:-->
                    <xsd1:errRecord></xsd1:errRecord>
                    <!--Optional:-->
                    <xsd1:errSourceCd></xsd1:errSourceCd>
                    <!--Optional:-->
                    <xsd1:exceptionCatgCd></xsd1:exceptionCatgCd>
                    <!--Optional:-->
                    <xsd1:exceptionCd></xsd1:exceptionCd>
                </xsd:errorList>
                <!--Optional:-->
                <xsd:authenticationTO>
                    <!--Optional:-->
                    <xsd2:authenticationDetailsTO>
                        <!--Optional:-->
                        <xsd2:emailId></xsd2:emailId>
                        <!--Optional:-->
                        <xsd2:encryptionMethod></xsd2:encryptionMethod>
                        <!--Optional:-->
                        <xsd2:transactionType></xsd2:transactionType>
                        <!--Optional:-->
                        <xsd2:userExpiredDate></xsd2:userExpiredDate>
                        <!--Optional:-->
                        <xsd2:userName></xsd2:userName>
                    </xsd2:authenticationDetailsTO>
                    <!--Optional:-->
                    <xsd2:authenticationResultTO>
                        <!--Optional:-->
                        <xsd2:authenticated></xsd2:authenticated>
                        <!--Optional:-->
                        <xsd2:statusCode></xsd2:statusCode>
                        <!--Optional:-->
                        <xsd2:statusDescription></xsd2:statusDescription>
                    </xsd2:authenticationResultTO>
                    <!--Optional:-->
                    <xsd2:field1>Cigna</xsd2:field1>
                    <!--Optional:-->
                    <xsd2:field2></xsd2:field2>
                    <!--Optional:-->
                    <xsd2:source />
                    <!--Optional:-->
                    <xsd2:transactionSignature>48b512f3d584219647e97ca424176d94</xsd2:transactionSignature>
                    <!--Optional:-->
                    <xsd2:userId>KARVY</xsd2:userId>
                </xsd:authenticationTO>
                <!--Zero or more repetitions:-->
                <xsd:listGeneratePolicyNumTO>
                    <!--Optional:-->
                    <xsd1:agentId></xsd1:agentId>
                    <inwardTypeCd>NEWBUSINESS</inwardTypeCd>
                    <inwardSubTypeCd>PROPOSALDOCUMENT</inwardSubTypeCd>
                    <!--Optional:-->
                    <xsd1:proposalNum></xsd1:proposalNum>
                    <!--Optional:-->
                    <xsd1:quoteId>___quote_id___</xsd1:quoteId>
                    <!--Optional:-->
                    <xsd1:renewalYear></xsd1:renewalYear>
                    <!--Optional:-->
                    <xsd1:statusCd></xsd1:statusCd>
                    <!--Optional:-->
                    <xsd1:subPlanId></xsd1:subPlanId>
                </xsd:listGeneratePolicyNumTO>
            </sym:wsGeneratePolicyNumIO>
        </sym:saveProposal>
    </soap:Body>
</soap:Envelope>